БухЭксп/Catalogs/CW_ТипыСлежения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ТипыСлежения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОборудованияПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатусыОтслеживаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Статусы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КонтрольнаяДата</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_СтатусыОтслеживаемогоОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонОписания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеОтбора</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборУстановлен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonForms/CW_МониторингОборудованияНастройки/Ext/Form/Module.bsl
&НаКлиенте
Перем ОбновитьИнтерфейс;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСписокПараметровНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнятьПоискОборудованиПриИзменении(Элемент) 
	
	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);

	ВыполнятьПоискОборудованиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнятьПоискОборудованиПриИзмененииНаСервере()
	
	НаборКонстант.CW_АвтоматическиПодставлятьОборудованиеНаСлеженииВГрузоперевозку = Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьПараметр(Команда)
	
	ТекущаяСтрока = Элементы.СписокПараметров.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		ОткрытьФормуПараметра(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьФормуПараметра(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПараметра(ВыбраннаяСтрока)
	
	ТекущиеДанные = СписокПараметров.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеРедактированияПараметра", ЭтотОбъект, ВыбраннаяСтрока);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ключ", ТекущиеДанные.КонтрольнаяДата);
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаОбъекта", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПослеРедактированияПараметра(Результат, ВыбраннаяСтрока) Экспорт
	
	ОбновитьСтрокуНаСервере(ВыбраннаяСтрока);
	
	Элементы.СписокПараметров.ТекущаяСтрока = ВыбраннаяСтрока;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтрокуНаСервере(ВыбраннаяСтрока)
	
	 ТекущиеДанные = СписокПараметров.НайтиПоИдентификатору(ВыбраннаяСтрока);
	 
	 ТекущиеДанные.ИспользуетсяВремя = ТекущиеДанные.КонтрольнаяДата.КонтрольнаяДатаИспользуетВремя;
	 ТекущиеДанные.ИндексКартинки    = ?(ТекущиеДанные.КонтрольнаяДата.КонтрольнаяДатаИспользуетВремя, 1, 2);
	 
 КонецПроцедуры


&НаКлиенте
Процедура ОбновитьСписокПараметров(Команда)
	ОбновитьСписокПараметровНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокПараметровНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ТипыСлеженияСтатусы.КонтрольнаяДата КАК КонтрольнаяДата,
	               |	CW_ТипыСлеженияСтатусы.КонтрольнаяДата.КонтрольнаяДатаИспользуетВремя КАК ИспользуетсяВремя,
	               |	ВЫБОР
	               |		КОГДА CW_ТипыСлеженияСтатусы.КонтрольнаяДата.КонтрольнаяДатаИспользуетВремя
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК ИндексКартинки
	               |ИЗ
	               |	Справочник.CW_ТипыСлежения.Статусы КАК CW_ТипыСлеженияСтатусы
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КонтрольнаяДата";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СписокПараметров.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры





#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииРеквизитаФормы(Элемент)
	
	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриИзмененииРеквизитаНаКлиенте(Элемент, ОбновлятьИнтерфейс = Истина)
	
	КонстантаИмя = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	Если ОбновлятьИнтерфейс Тогда
		ОбновитьИнтерфейс = Истина;
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	КонецЕсли;
	
	Если КонстантаИмя <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
	КонецЕсли; 
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	
	КонстантаИмя = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	Если РеквизитПутьКДанным = "" Тогда
		Возврат "";
	КонецЕсли;
	
	// Определение имени константы.
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
	КонецЕсли;
	
	// Сохранения значения константы.
	Если КонстантаИмя <> "" Тогда
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры

#КонецОБласти
